# IsDone Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModuleIterator..::..IsDone Method
MacroModuleIterator Class See Also
---
Identifies if the iteration has completed.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public virtual bool IsDone()
```

Visual Basic
---
```text
Public Overridable Function IsDone As Boolean
```

Visual C++
---
```text
public:
virtual bool IsDone()
```

# ### Return Value
True if the iteration has no more items. False if there are more items to be iterated.
# See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace